--[[
#
#ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#😩
# For More Information ....! 
# Developer :  < @M1_l1 > 
#  Developer :  < @A1_b1 > 
# our : vrbot
# Version: 1.1
#:))
#ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
#
]]
do

local function run(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'الاوامر' then
local S = [[  
🌐 - الادمنية / لضاهر ادمنيه المجموعه
🌐 - المشرف / لضهار مسئول المجموعه
🌐 -	ارفع اداري / لرفع اداري بلمجموعه
🌐 -	انزل اداري / لتنزيل الاداري 
🌐 -	ارفع مشرف / لرفع ادمن
  ـ ➖➖➖⚠️✅➖➖
✔️  قائمة الحظر… 😉والطرد.🏃🚪
🌐 - بلوك : لطرد العضو
🌐 - حظر : لحظر العظر
🌐 - الغاء الحظر : فتح الخظر عن العضو
🌐 - مغادره : للخروج من المجموعة
🌐 -	امسح / لمسح رسائل العضو بلرد	
🌐 -	اش / لكتم العضو
🌐 -	اش / لفتح كتم العضو
🌐 - منع كلمه  : لحضر الكلمة ب مجموعه
🌐 - الغاء المنع : لفتح حضر الكلمة
🌐 - قائمه المنع : لعرض الكلمات المحظورة
  
  ـ ➖➖🔶➖➖🔷➖
✔️  اوامر تحكم المجموعه .🛡💢
🌐 - صنع الرابط / لصنع رابط
🌐 -	وضع الرابط / لضافه رابط المجموعه
🌐 -	الرابط / لضهار الرابط
🌐 -	وضع الاسم / لي ضافه اسم للامجموعه
🌐 - وضع الوصف / لي اضافه وصف للمجموعه
🌐 -	وضع القوانين / لي اضافه قوانين للمجموعه
🌐 -	وضع الصورة / لي وضع صورة للمجموعه
🌐 -	وضع المعرف / لي اضافه معرف للمجموعه

  ـ🔸➖🔹➖🔸➖🔹➖
✔️  آوامر امان المجموعه...🛡💢 
💂 قفل الاضافه  : لمنع الاضافه ب المجموعه
💂 قفل الاضافه  : لسماح الاضافه ب ===
💂 قفل الدردشه : لمنع الدردشه للمجموعه
💂 فتح الدردشه  : للسماح للدردشه للمجموعه
💂 قفل الصور : لمنع إرسال الصور 
💂 فتح الصور  : للسماح بإرسال الصور 
💂 قفل الصوت  : لمنع البصمات 
💂 فتح الصوت   : للسماح بإرسال البصمات 
💂 قفل الفيديو  : لمنع ارسال فديو 
💂 فتح الفيديو   : للسماح بإرسال فديو 
💂 قفل الروابط   : لمنع الروابط 
💂 فتح الروابط  : للسماح بإرسال روابط
💂 قفل التكرار  : لمنع التكرار 
💂 فتح التكرار   : للسماح بلتكرار 
💂 -	تعيين التكرار / لي اضافه عدد تكرار (25-2)
💂 قفل الملصقات : لمنع الملصقات 
💂 فتح الملصقات : للسماح بلملصقات
💂 قفل الصور المتحركه : لمنع الصور المتحركة
💂 فتح الصور المتحركه  : للسماح بالصور المتحركة
💂 قفل الفايلات  : لمنع ارسال الملفات 
💂 فتح الفايلات   : للسماح بإرسال الملفات 
💂 قفل الكلايش : لمنع الكلايش الطويلة
💂 فتح الكلايش : للسماح بلكلايش الطويلة
💂 قفل الجماعيه : منع  الاعضاء بالاضافه
💂 فتح الجماعيه : سماح الاعضاء بالاضافه
💂 قفل العربيه  : لمنع اللغة ألعربيه 
💂 فتح العربيه  : للسماح بلغه ألعربيه
💂 قفل اعاده توجيه : منع اعادة توجيه 
💂 فتح اعاده توجيه : سماح باعادة توجيه
  ـ🔸➖🔹➖🔸➖🔹➖
🃏🔺 dev  ارسل لمعرفة مصنع البوت

Developer :  < @M1_l1 > 
Developer :  < @A1_b1 >
]]
reply_msg(reply_id, S, ok_cb, false)
end

if not is_momod(msg) then
local S = "للمشرفين فقط 😎🖕🏿"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(الاوامر)$",
},
run = run 
}
end